/********************************************************************************
 * Л А Б О Р А Т О Р Н А Я   Р А Б О Т А  №3  З А   3   С Е М Е С Т Р   С  +  + *
 *------------------------------------------------------------------------------*
 * Project Type  : Win64 Console Application                                    *
 * Project Name  : Search algorithms                                            *
 * File Name     : Алгоритмы сортировки. CPP                                    *
 * Programmer(s) : Викулов Д.Г.                                                 *
 * Modifyed By   :                                                              *
 * Created       : 29/10/22                                                     *
 * Last Revision : 06/11/22                                                     *
 * Comment(s)    : реализация алгоритмов сортирвки: Шейкерная сортировка,       *
 *                 сортировка выбором, сортировка вставкой, сортировка слиянием,*
 *                 быстрая сортировка, сортировка Шелла                         *
 ********************************************************************************/

#include <iostream>           // стандартные потоки ввода/вывода
#include "Promeg_functions.h" // подключаем заголовочный файл с прототипами вспомогательных функций 


/**************************************************************/
/*            О С Н О В Н А Я   П Р О Г Р А М М А             */
/**************************************************************/
int main()
{
	system("color F0");                      // делаем консоль светлой
	setlocale(LC_ALL, "Rus");                // подключаем русский язык
	system("cls");                           // чистим консоль перед выводом

	int number = 0;                          // количество элементов массива
	int* pznachenue = NULL;                  // указатель на динамический массив целых чисел
	pechat_mass_search(pznachenue, number);  // вызов основной функции, где будут вызываться другие
	return 0;                                // возвращаем обещанное значение
} //main()
